<?php

//任意制度数学関数を使用して小数点一桁まで計算するように変更

// $a = 0.1 + 0.2;
// echo $a;

$a = bcadd("0.1", "0.2", 1);
echo $a;

//以下のコードを実行した場合の答え

$b = bcadd("0.1", "0.2", 2);
echo $b;

//出力結果は？
//0.30

$c = bcmul("1.05", "1.07", 4);
echo $c;

//出力結果は？
//1.1235

$arr1 = ["a" => 1, "b" => 2];
$arr2 = ["b" => 3, "c" => 4];
$arr3 = $arr1 + $arr2;
var_dump($arr3);

//出力結果は？
// array(3) {
//   ["a"]=> int(1)
//   ["b"]=> int(2)
//   ["c"]=> int(4)
// }

//array_merge関数を使用した場合
$arr7 = ["a" => 1, "b" => 2];
$arr8 = ["b" => 3, "c" => 4];
$arr9 = array_merge($arr7, $arr8);
var_dump($arr9);
//出力結果は？
// array(3) {
//   ["a"]=> int(1)
//   ["b"]=> int(3)
//   ["c"]=> int(4)
// }

$x = 10;
$y = $x;
$y = 20;
echo $x;

//出力結果は？
//10

$w = 10;
$z = & $w;
$z = 20;
echo $w;

//出力結果は？
//20
